# Creating Dataframes Using Different Methods

In [1]:
import pandas as pd
import numpy as np

### Finding data type

In [4]:
my_series=pd.Series([2,4,6,8])
print(my_series.dtype)

int64

### Converting to list

In [5]:
print(my_series.tolist())

[2, 4, 6, 8]

## Pandas dataframe

### Empty dataframe

In [11]:
my_df=pd.DataFrame()
print(my_df)

Empty DataFrame
Columns: []
Index: []

### 1.Dataframe using list of lists

In [13]:
stationery=[['Bag',900],['Shoes',850],['Umbrella',450],['Books',250],['Pencil',15],['Pen',30],['Eraser',5],['Box',50],['Waterbottle',600],['Lunch box',650]]
my_df=pd.DataFrame(stationery,columns=['Stationery items','Price'])
my_df

  Stationery items  Price
0              Bag    900
1            Shoes    850
2         Umbrella    450
3            Books    250
4           Pencil     15
5              Pen     30
6           Eraser      5
7              Box     50
8      Waterbottle    600
9        Lunch box    650

### 2.Dataframe using dictionaries

In [14]:
students={'Name':['Manu','Arun','Vineeth','Saran','Rahul'],'Age':[11,15,10,16,13]}
my_df=pd.DataFrame(students)
my_df

      Name  Age
0     Manu   11
1     Arun   15
2  Vineeth   10
3    Saran   16
4    Rahul   13

### 3.Dataframe using list of dictionaries

In [18]:
students=[{'Name':'Manu','Age':12},{'Name':'Arun','Age':13},{'Name':'Veena','Age':10},{'Name':'Geethu','Age':'11'},{'Name':'Rahul','Age':14}]
my_df=pd.DataFrame(students)
my_df

     Name Age
0    Manu  12
1    Arun  13
2   Veena  10
3  Geethu  11
4   Rahul  14

### 4.Dataframe using list of dictionaries with null items

In [19]:
students=[{'Name':'Manu','Age':12},{'Name':'Arun','Age':13},{'Name':'Veena','Age':10},{'Age':'11'},{'Name':'Rahul','Age':14}]
my_df=pd.DataFrame(students)
my_df

    Name Age
0   Manu  12
1   Arun  13
2  Veena  10
3    NaN  11
4  Rahul  14